In [1]:
import pandas as pd
housing = pd.read_csv("C:/Users/munur/Documents/GitHub/B-13-RealtyAI-Smart-Real-Estate-Insight-Platform/datasets/real_estate_dataset.csv")
pd.set_option("display.max_rows", 5)

In [2]:
housing.groupby('beds').beds.count()

beds
0     74
1     13
      ..
10     2
12     1
Name: beds, Length: 11, dtype: int64

In [3]:
housing.groupby('beds').price.min()

beds
0            5.15
1            9.00
         ...
10     6500000.00
12    42000000.00
Name: price, Length: 11, dtype: float64

In [4]:
housing.groupby('size').apply(lambda df: df.price.iloc[0])

size
0 sq.ft.     7600000.0
0 sqft      39800000.0
               ...
sq.ft          17400.0
various      9059000.0
Length: 211, dtype: float64

In [5]:
housing.groupby(['city', 'type']).apply(lambda df: df.loc[df.beds.idxmax()])

                                                                                     url  \
city          type
Agra          2 BHK Flat               https://www.99acres.com/2-bhk-bedroom-apartmen...
              3 BHK Flat               https://www.99acres.com/3-bhk-bedroom-apartmen...
...                                                                                  ...
Visakhapatnam Residential property     https://www.99acres.com/other-residential-prop...
Vizianagaram  Residential land / Plot  https://www.99acres.com/residential-land-plot-...

                                       beds                      date  \
city          type
Agra          2 BHK Flat                  2                   2mo ago
              3 BHK Flat                  3                   2mo ago
...                                     ...                       ...
Visakhapatnam Residential property        0                   3mo ago
Vizianagaram  Residential land / Plot     0  2025-02-19T04:38:35.432Z

                                              size  baths       price  \
city          type
Agra          2 BHK Flat                  968 sqft      2   5200000.0
              3 BHK Flat                 1883 sqft      3  11000000.0
...                                            ...    ...         ...
Visakhapatnam Residential property     740520 sqft      0  40000000.0
Vizianagaram  Residential land / Plot    7200 sqft      0  16000000.0

                                       neighborhood
city          type
Agra          2 BHK Flat               Shastripuram
              3 BHK Flat                 Taj Nagari
...                                             ...
Visakhapatnam Residential property      Narsipatnam
Vizianagaram  Residential land / Plot    Modavalasa

[126 rows x 7 columns]

In [6]:
housing.groupby(['city']).price.agg([len, min, max])

               len         min          max
city
Agra            10   4000000.0  600000000.0
Bangalore       10    889000.0   39800000.0
...            ...         ...          ...
Visakhapatnam   25   3000000.0   40000000.0
Vizianagaram     1  16000000.0   16000000.0

[26 rows x 3 columns]

-multi-indexes

In [8]:
cities_reviewed = housing.groupby(['city', 'type']).url.agg([len])
cities_reviewed

                                       len
city          type
Agra          2 BHK Flat                 2
              3 BHK Flat                 2
...                                    ...
Visakhapatnam Residential property       1
Vizianagaram  Residential land / Plot    1

[126 rows x 1 columns]

In [9]:
mi = cities_reviewed.index
type(mi)

pandas.MultiIndex

In [10]:
cities_reviewed.reset_index()

              city                     type  len
0             Agra               2 BHK Flat    2
1             Agra               3 BHK Flat    2
..             ...                      ...  ...
124  Visakhapatnam     Residential property    1
125   Vizianagaram  Residential land / Plot    1

[126 rows x 3 columns]

-Sorting

In [11]:
cities_reviewed = cities_reviewed.reset_index()
cities_reviewed.sort_values(by='len')

         city             type  len
3        Agra  4 Bedroom House    1
2        Agra  3 Bedroom House    1
..        ...              ...  ...
74   Kakinada            Villa   10
100     Noida        Apartment   10

[126 rows x 3 columns]

In [12]:
cities_reviewed.sort_values(by='len', ascending=False)

              city                     type  len
100          Noida                Apartment   10
74        Kakinada                    Villa   10
..             ...                      ...  ...
124  Visakhapatnam     Residential property    1
125   Vizianagaram  Residential land / Plot    1

[126 rows x 3 columns]

In [13]:
cities_reviewed.sort_index()

              city                     type  len
0             Agra               2 BHK Flat    2
1             Agra               3 BHK Flat    2
..             ...                      ...  ...
124  Visakhapatnam     Residential property    1
125   Vizianagaram  Residential land / Plot    1

[126 rows x 3 columns]

In [14]:
cities_reviewed.sort_values(by=['city', 'len'])

              city                     type  len
2             Agra          3 Bedroom House    1
3             Agra          4 Bedroom House    1
..             ...                      ...  ...
123  Visakhapatnam  Residential land / Plot    9
125   Vizianagaram  Residential land / Plot    1

[126 rows x 3 columns]